In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("census.csv")

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   state            129 non-null    object
 1   state fips       129 non-null    int64
 2   commodity        129 non-null    object
 3   data item        129 non-null    object
 4   domain category  15 non-null     object
 5   2017             127 non-null    object
 6   2012             124 non-null    object
 7   2007             124 non-null    object
 8   2002             124 non-null    object
 9   1997             117 non-null    object
dtypes: int64(1), object(9)
memory usage: 10.2+ KB

In [6]:
df.sample(5)

,state,state fips,commodity,data item,domain category,2017,2012,2007,2002,1997
45,US TOTAL,99,CATTLE,"CATTLE, INCL CALVES - OPERATIONS WITH INVENTORY",NaN,"882,692","913,246","963,669","1,018,359","1,188,659"
92,US TOTAL,99,SOYBEANS,SOYBEANS - ACRES HARVESTED,NaN,"90,149,480","76,104,780","63,915,821","72,399,844","67,773,274"
126,US TOTAL,99,SWEET POTATOES,SWEET POTATOES - ACRES HARVESTED,NaN,"172,983","125,726","105,284","92,310","80,953"
8,US TOTAL,99,FARM OPERATIONS,FARM OPERATIONS - ACRES OPERATED,NaN,"900,217,576","914,527,657","922,095,840","938,279,056","954,752,502"
125,US TOTAL,99,SWEET POTATOES,SWEET POTATOES - OPERATIONS WITH AREA HARVESTED,NaN,"4,798","2,202","1,910","2,366","1,976"

In [16]:
df["domain category"].value_counts()

AREA OPERATED: (1.0 TO 9.9 ACRES)        1
AREA OPERATED: (10.0 TO 49.9 ACRES)      1
AREA OPERATED: (50 TO 179 ACRES)         1
AREA OPERATED: (180 TO 499 ACRES)        1
AREA OPERATED: (500 TO 999 ACRES)        1
AREA OPERATED: (1,000 TO 1,999 ACRES)    1
AREA OPERATED: (2,000 OR MORE ACRES)     1
FARM SALES: (LESS THAN 2,500 $)          1
FARM SALES: (2,500 TO 4,999 $)           1
FARM SALES: (5,000 TO 9,999 $)           1
FARM SALES: (10,000 TO 24,999 $)         1
FARM SALES: (25,000 TO 49,999 $)         1
FARM SALES: (50,000 TO 99,999 $)         1
FARM SALES: (100,000 TO 499,999 $)       1
FARM SALES: (500,000 OR MORE $)          1
Name: domain category, dtype: int64

In [17]:
df["state"].value_counts()

US TOTAL    129
Name: state, dtype: int64

In [18]:
df["state fips"].value_counts()

99    129
Name: state fips, dtype: int64

In [23]:
df["data item"].value_counts()

COMMODITY TOTALS - OPERATIONS WITH SALES            9
FARM OPERATIONS - NUMBER OF OPERATIONS              8
SORGHUM, SILAGE - OPERATIONS WITH AREA HARVESTED    1
COTTON - PRODUCTION, MEASURED IN BALES              1
COTTON - ACRES HARVESTED                            1
                                                   ..
CATTLE, COWS, MILK - INVENTORY                      1
CATTLE, COWS, MILK - OPERATIONS WITH INVENTORY      1
CATTLE, COWS, BEEF - INVENTORY                      1
CATTLE, COWS, BEEF - OPERATIONS WITH INVENTORY      1
ORCHARDS - ACRES BEARING & NON-BEARING              1
Name: data item, Length: 114, dtype: int64

In [20]:
clean_df = df.drop(["state", "state fips"], axis=1)

In [22]:
clean_df.head(5)

,commodity,data item,domain category,2017,2012,2007,2002,1997
0,FARM OPERATIONS,FARM OPERATIONS - NUMBER OF OPERATIONS,NaN,"2,042,220","2,109,303","2,204,792","2,128,982","2,215,876"
1,FARM OPERATIONS,FARM OPERATIONS - NUMBER OF OPERATIONS,AREA OPERATED: (1.0 TO 9.9 ACRES),"273,325","223,634","232,849","179,346","205,390"
2,FARM OPERATIONS,FARM OPERATIONS - NUMBER OF OPERATIONS,AREA OPERATED: (10.0 TO 49.9 ACRES),"583,001","589,549","620,283","563,772","530,902"
3,FARM OPERATIONS,FARM OPERATIONS - NUMBER OF OPERATIONS,AREA OPERATED: (50 TO 179 ACRES),"564,763","634,047","660,530","658,705","694,489"
4,FARM OPERATIONS,FARM OPERATIONS - NUMBER OF OPERATIONS,AREA OPERATED: (180 TO 499 ACRES),"315,017","346,038","368,368","388,617","428,215"

In [50]:
melt_df = clean_df.melt(id_vars = ["data item", "commodity", "domain category"])

In [59]:
melt_df

,data item,commodity,domain category,variable,value
0,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,NaN,2017,"2,042,220"
1,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (1.0 TO 9.9 ACRES),2017,"273,325"
2,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (10.0 TO 49.9 ACRES),2017,"583,001"
3,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (50 TO 179 ACRES),2017,"564,763"
4,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (180 TO 499 ACRES),2017,"315,017"
...,...,...,...,...,...
640,POTATOES - ACRES HARVESTED,POTATOES,NaN,1997,"1,372,458"
641,SWEET POTATOES - OPERATIONS WITH AREA HARVESTED,SWEET POTATOES,NaN,1997,"1,976"
642,SWEET POTATOES - ACRES HARVESTED,SWEET POTATOES,NaN,1997,"80,953"
643,ORCHARDS - OPERATIONS WITH AREA BEARING & NON-...,ORCHARDS,NaN,1997,"123,420"
644,ORCHARDS - ACRES BEARING & NON-BEARING,ORCHARDS,NaN,1997,NaN

In [60]:
melt_df = melt_df.rename(columns={"variable": "year"})

In [61]:
melt_df

,data item,commodity,domain category,year,value
0,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,NaN,2017,"2,042,220"
1,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (1.0 TO 9.9 ACRES),2017,"273,325"
2,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (10.0 TO 49.9 ACRES),2017,"583,001"
3,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (50 TO 179 ACRES),2017,"564,763"
4,FARM OPERATIONS - NUMBER OF OPERATIONS,FARM OPERATIONS,AREA OPERATED: (180 TO 499 ACRES),2017,"315,017"
...,...,...,...,...,...
640,POTATOES - ACRES HARVESTED,POTATOES,NaN,1997,"1,372,458"
641,SWEET POTATOES - OPERATIONS WITH AREA HARVESTED,SWEET POTATOES,NaN,1997,"1,976"
642,SWEET POTATOES - ACRES HARVESTED,SWEET POTATOES,NaN,1997,"80,953"
643,ORCHARDS - OPERATIONS WITH AREA BEARING & NON-...,ORCHARDS,NaN,1997,"123,420"
644,ORCHARDS - ACRES BEARING & NON-BEARING,ORCHARDS,NaN,1997,NaN